Revit 2026 API

# IEntryPoint Methods

---

The IEntryPoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FinishInitialization |  |
|  | Initialize |  |
|  | OnShutdown |  |

#### Reference

IEntryPoint Interface

Autodesk.Revit.DB.Macros Namespace